{
    "Social Science" : {
        "History": {
            "The Rise of Nationalism in Europe": [
                "Write a note on Guiseppe Mazzini.",
                "Write a note on Count Camillo de Cavour.",
                "Write a note on The Greek war of independence.",
                "Write a note on Frankfurt parliament.",
                "What steps did the French revolutionaries take to create a sense of collective identity among the French people?",
                "Who were Marianne and Germania? What was the importance of the way in which they were portrayed?",
                "Briefly trace the process of German unification.",
                "What changes did Napoleon introduce to make the administrative system more efficient in the territories ruled by him?",
                "Explain what is meant by the 1848 revolution of the liberals. What were the political, social and economic ideas supported by the liberals?",
                "How was the history of nationalism in Britain unlike the rest of Europe?"
            ],
            "Nationalism in India": [
                "Why is the growth of nationalism in the colonies linked to an anti-colonial movement ?",
                "How did the First World War help in the growth of the National Movement in India?",
                "Explain any four facts to show how the First World War helped in the growth of the National Movement in India.",
                "Why were Indians outraged by the Rowlatt Act ?",
                "Why did Gandhiji decide to withdraw the Non-Cooperation Movement?",
                "What is meant by the idea of Satyagraha?",
                "List all the different social groups which joined the Non-Cooperation Movement of 1921. Choose any three, and write about their hopes and struggles to show why they joined the movement.",
                "Discuss the Salt March to make clear why it was an effective symbol of resistance against colonialism.",
                "Why did the political leaders differ sharply over the question of separate electorates ?"
            ],
            "The Making of a Global World": [
                "Give two examples of different types of global exchanges which took place before the 17th century, choosing one example from Asia, and one from America.",
                "Give two examples from history to show the impact of Science and Technology on food availability.",
                "Explain how the global transfer of disease in the pre-modern world helped in the colonisation of the Americas.",
                "Write a note to explain the effect of the British government's decision to abolish the Corn Laws.",
                "Write a note to explain the effect of the coming of rinderpest to Africa.",
                "Write a note to explain the effect of the death of men of working age in Europe because of the World War.",
                "Write a note to explain the effect of the Great Depression on the Indian economy.",
                "Write a note to explain the effect of the decision of MNCs to relocate production to Asian countries.",
                "Give two examples from history to show the impact of technology on food availability.",
                "What is meant by the Bretton Woods Agreement?",
                "Explain the three types of movements or flows within the international economic exchange. Find one example of each type of flow which involved India and Indians, and write a short account of it.",
                "Explain the causes of the Great Depression."
            ]
        },
        "Political Science": {
            "Power Sharing": [
                "What are the different forms of power-sharing in modern democracies? Give an example of each of these.",
                "State one prudential reason and one moral reason for power-sharing with an example from the Indian context.",
                "How are the ethnic problem solved in Belgium? Mention any four steps which were taken by the governments to solve the problem?",
                "Describe the population composition of Sri Lanka and the reasons for the formation of Majoritarian government in 1948.",
                "What are the outcomes and the lessons we learnt from the style of governance in Sri Lanka and Belgium?",
                "Explain the power sharing arrangement among the different political parties, pressure groups and movements."
            ],
            "Federalism": [
                "What are the causes responsible for the very slow progress of the Panchayat Raj System in India?",
                "What are the features of Federalism?",
                "Explain how power is shared among different organs of the government.",
                "Describe the language policy of India?",
                "In what way is the Panchayat Raj experiment Significant? Explain."
            ],
            "Gender, Religion and Caste": [
                "Mention different aspects of life in which women are discriminated or disadvantaged in India.",
                "State different forms of communal politics with one example each.",
                "State how caste inequalities are still continuing in India.",
                "State two reasons to say that caste alone cannot determine election results in India.",
                "What is the status of women's representation in India's legislative bodies?",
                "Mention any two constitutional provisions that make India a secular state."
            ],
            "Political Parties": [
                "State the various functions political parties perform in a democracy.",
                "What are the various challenges faced by political parties?",
                "What are the characteristics of a political party?",
                "Suggest some reforms to strengthen parties so that they perform their functions well.",
                "What is Multi-Party system? Discuss the merits and demerits of multi-party system",
                "Examine the concept 'use of money and muscle power' in the Political Parties"
            ],
            "Outcomes of Democracy": [
                "How does democracy produce an accountable, responsive and legitimate government?",
                "What are the conditions under which democracies accommodate social diversities?",
                "How can democracy accommodate the dignity of women and caste discrimination in one system?",
                "Democracy means delay in the decision-making. Which one is preferable - quick decision-making process of dictatorship or slow decision-making process of democracy?",
                "\"Democracies lead to peaceful and harmonious life among citizens.\" Support this statement with suitable arguments.",
                "How do people take part in decision making in democracy? Explain.",
                "Which factors sustain democracy in India?"
            ]
        },
        "Economics": {
            "Development": [
                "What is the main criterion used by the World Bank in classifying different countries? What are the limitations of this criterion, if any?",
                "In what respects is the criterion used by the UNDP for measuring development different from the one used by the World Bank?",
                "Why do we use averages? Are there any limitations to their use? Illustrate with your own examples related to development.",
                "Kerala, with lower per capita income, has a better human development ranking than Haryana. Hence, per capita income is not a useful criterion at all and should not be used to compare states. Do you agree? Discuss.",
                "Why is the issue of sustainability important for development?",
                "\"The Earth has enough resources to meet the needs of all but not enough to satisfy the greed of even one person.\" How is this statement relevant to the discussion of development? Discuss."
            ],
            "Sectors of the Indian Economy": [
                "How is the tertiary sector different from other sectors? Illustrate with a few examples.",
                "What do you understand by disguised unemployment? Explain with an example each from the urban and rural areas.",
                "Distinguish between open unemployment and disguised unemployment.",
                "Tertiary sector is not playing any significant role in the development of the Indian economy.” Do you agree? Give reasons in support of your answer.",
                "Service sector in India employs two different kinds of people. Who are these?",
                "Workers are exploited in the unorganised sector. Do you agree with this view? Give reasons in support of your answer."
            ],
            "Money and Credit": [
                "In situations with high risks, credit might create further problems for the borrower. Explain.",
                "How does money solve the problem of double coincidence of wants? Explain with an example of your own.",
                "How do banks mediate between those who have surplus money and those who need money?",
                "Why do we need to expand formal sources of credit in India?",
                "What is the basic idea behind the SHGs for the poor? Explain in your own words.",
                "What are the reasons why banks might not be willing to lend to certain borrowers?",
                "In what ways does the Reserve Bank of India supervise the functioning of banks? Why is this necessary?"
            ],
            "Globalisation and the Indian Economy": [
                "What do you understand about globalization? Explain in your own words.",
                "What were the reasons for putting barriers to foreign trade and foreign investment by the Indian government? Why did it wish to remove these barriers?",
                "How would flexibility in labor laws help companies?",
                "What are the various ways in which MNCs set up, or control, production in other countries?",
                "Why do developed countries want developing countries to liberalize their trade and investment? What do you think should the developing countries demand in return?",
                "\"The impact of globalization has not been uniform.\" Explain this statement.",
                "How has liberalization of trade and investment policies helped the globalization process?"
            ]
        },
        "Geography": {
            "Resources and Development": [
                "Classify resources on the basis of ownership with example.",
                "Classify resources on the basis of state of development with example.",
                "Why is resource planning important in the context of a country like India?",
                "How has technical and economic development led to more consumption of resources?",
                "Explain the land use pattern in India?",
                "Explain any five proper farming techniques which can be used for soil conservation.",
                "How is red soil formed? Mention its features."
            ],
            "Forest and Wildlife Resources": [
                "How are forests useful to man?",
                "Explain how human activities have affected the depletion of flora.",
                "What were the views of foresters and environmentalists regarding the degrading factors behind the depletion of forest resources?",
                "What steps must be taken to preserve the natural vegetation?",
                "What are the steps taken by the Government to conserve flora and fauna of the country?",
                "Describe how communities have conserved and protected forests and wildlife in India.",
                "Mention the negative factors which, since pre-independence to the present period, have contributed significantly to the fearful depletion of flora and fauna in India."
            ],
            "Water Resources": [
                "Compare the advantages and disadvantages of multi-purpose river projects.",
                "Discuss how rainwater harvesting in semi-arid regions of Rajasthan is carried out.",
                "Describe how modern adaptations of traditional rainwater harvesting methods are being carried out to conserve and store water.",
                "How intensive industrialization and urbanization have put great pressure on existing freshwater resources in India? Explain with two examples for each.",
                "What is the 'Narmada Bachao Andolan'? Why was it organized? What are the issues raised by this movement?",
                "Three-fourths of the world is covered with water, and water is a renewable resource. Yet many countries and regions around the globe suffer from water scarcity. Explain."
            ],
            "Agriculture": [
                "Suggest the initiatives taken by the government to ensure an increase in agricultural production.",
                "Describe the impact of globalization on Indian agriculture.",
                "Explain the favorable temperature, rainfall, and soil conditions required for the growth of tea. Name the leading tea-producing states.",
                "Name the major Horticulture Crops of India and also write their areas of cultivation.",
                "Which is the staple crop for the majority of the people in India? What are the geographical conditions required for its growth? Name the major areas of its production.",
                "Which crop is known as golden fiber? What are the geographical conditions required for its growth? Name the major areas of its production.",
                "Why has the growth rate in agriculture been decreasing day by day? Give reasons."
            ],
            "Minerals and Energy Resources": [
                "What are Non-Conventional Sources of Energy? Why do they have a bright future in India?",
                "Write a short note on Bauxite, its formation, features, and distribution in India.",
                "Why is there a need for the conservation of minerals?",
                "How would you classify the types of coal depending on the degrees of compression?",
                "Distinguish between conventional and non-conventional sources of energy.",
                "Explain any five types of non-conventional sources of energy developed in India.",
                "Describe the importance of minerals in human life."
            ],
            "Manufacturing Industries": [
                "Why are industries located in or near the cities? What were its results in the pre-independence period?",
                "Analyze the advantages of the decentralization of industries in India.",
                "How will you elaborate the importance of manufacturing? Explain.",
                "Explain the different stages in the process of manufacturing steel.",
                "How is Integrated Steel Plants different from Mini steel plants? What problems does this industry face?",
                "What ideas justify that agriculture and industry are not exclusive of each other?",
                "Why are the cotton and textile industries spread all over India? Explain five reasons with suitable examples."
            ],
            "Lifelines of National Economy": [
                "No countries can survive without international trade. Explain.",
                "\"Railways are the principal mode of transportation in India.\" Explain.",
                "How do physiographic and economic factors influence the distribution pattern of the Indian railway network? Explain with an example.",
                "Explain the major sea ports of India situated on the Western coastline.",
                "Name any two navigational rivers of India. In which part of India are inland waterways widely used? Write two merits and demerits of inland water transport.",
                "Efficient network of transport and communication is a prerequisite for local, national, and global trade of today. Explain.",
                "Explain the different reasons for the growing importance of road transport vis-à-vis rail transport."
            ]
        }
    },
    "English": {
        "First Flight": {
            "Prose": {
                    "A Letter To God": [
                    "Who was Lencho and what circumstances forced him to write a letter to God?",
                    "Give a character sketch of Lencho.",
                    "Sketch the character of the postmaster in the story 'A Letter to God.'",
                    "How do you like the character of the postmaster in the story 'A Letter to God'? Give reasons for your answer.",
                    "How did the postmaster and post office employees help Lencho? How did he react to their help?",
                    "How did the hailstones affect Lencho's field? What was Lencho's only hope?",
                    "Describe Lencho's qualities in light of his faith in God. Do you have faith in God like Lencho? Was Lencho's reaction towards the post office employees right?"
                ],
                "Nelson Mandela: Long Walk to Freedom": [
                    "What does Nelson Mandela refer to as 'an extraordinary human disaster'?",
                    "Describe the views of Mandela for the black people who fought and sacrificed their lives for the country's political independence.",
                    "What does Mandela mean when he says that the oppressor and the oppressed alike are robbed of their humanity?",
                    "Describe the value of freedom for human beings and how it is important for the growth of civilization and humanism, as described in the lesson 'Nelson Mandela: Long Walk to Freedom'."
                ],
                "Two Stories about Flying": [
                    "Do you think that the seagull's family loved him? Justify their attitude towards him.",
                    "Why was the young seagull pretending to be asleep? What did he actually observe while doing so?",
                    "How did the young seagull get over his fear of sea water, and what was his family's reaction to it?",
                    "Fear and lack of confidence stop one from learning new things. Do you agree? How did these two traits of the young seagull make him coward? How did he overcome these shortcomings?",
                    "How did the writer get out of the storm in the night to land safely?",
                    "Why was the writer happy when he decided to fly in the night?",
                    "The pilot wanted to thank another pilot after his safe landing. Why? What values of the writer are reflected from his action?"
                ],
                "From the Diary of Anne Frank": [
                    "Anne called 26th July a 'tumultuous' day. Explain the reasons behind it.",
                    "Why did Anne think that she could confide more in her diary than in people?",
                    "Who helped Anne in writing the essay and how?",
                    "Write the character sketch of Anne Frank.",
                    "'Paper has more patience than people.' Justify."
                ],
                "Glimpses of India": [
                    "Instead of enjoying their childhood, the children today are keen to enter adulthood. After reading about all the joys that the author Lucio Rodrigues had in his childhood, do you think such a keenness on the part of children is desirable?",
                    "After reading the story 'A Baker from Goa,' do you think our traditions, heritage, values, and practices are the roots that nourish us? Why or why not?",
                    "'During our childhood in Goa, the baker used to be our friend, companion, and guide.' What does this statement imply in relation to the character of the baker?",
                    "The Coorgis are the descendants of the Greeks or the Arabs and are still able to maintain their traditional practices. Do you agree that following these practices today is important? Why or why not?",
                    "How do Coorg's location, people, and natural features add to the diversity of India?",
                    "According to the text, Assam is said to be 'tea country.' Do you believe that Assam has some of the best plantations in the world that make it a unique country?"
                ],
                "Mijbil the Otter": [
                    "In the name of rules and regulations, basic values are ignored, but people like the airhostess in 'Mijbil the Otter' are a ray of hope. What virtues do we find in the airhostess?",
                    "The narrator called the airhostess the queen of her kind. This shows how caring and supportive she was. Do you find such people these days? Are people having a change in their values?",
                    "Why do you think the otter was not friendly at first with the narrator? Can you relate this to human nature as well?",
                    "Why was the narrator not able to communicate when there was a delay in the arrival of the mail?",
                    "What did the otter look like?",
                    "Why did Maxwell get his mail after five days, and what did he do to get it?"
                ],
                "Madam Rides the Bus": [
                    "In such a fast-moving world when we hear so many incidents happening with people, do you think Valli did right by not telling her mother about the bus journey?",
                    "The people and surroundings are a great book to learn. Valli in the lesson 'Madam Rides The Bus' learns a lot from others. Mention the traits of her character which help her to learn from her surroundings.",
                    "Age is not a barrier when it comes to doing something different and great. Which characteristics of Valli help her achieve the wonder of visiting the town at such a tender age?",
                    "What kind of person is Valli? Illustrate your answer from the text that you have read.",
                    "What did Valli keep on planning and calculating continuously?"
                ],
                "The Sermon at Benares": [
                    "Life is full of trials and tribulations. Kisa Gotami also passes through a period of grief in her life. How does she behave in those circumstances?",
                    "Personal losses are a part and parcel of life. Instead of wailing on them, we should move on in life. This message of Gautama Buddha has become more relevant in modern times. Do you agree? Why/why not?",
                    "What did Buddha say about death and suffering?",
                    "Why do you think Kisa Gotami understood this only the second time? In what way did Buddha change her understanding?"
                ],
                "The Proposal": [
                    "The principle 'forgive and forget' helps a lot in maintaining cordial relations with our neighbors. Do you think Anton Chekov conveys this message in the play 'The Proposal'?",
                    "The characters Natalya and Lomov lose their temper on trivial issues. It shows their poor skills at anger management. Suggest some ways that help you in maintaining a cordial relationship with people around you.",
                    "Based on your understanding of the play 'The Proposal,' how do you think good relationships can be maintained? Why in today's time do we see so many people going away from each other?",
                    "It is a common observance that more attention is paid to unimportant issues at the cost of important ones. The play 'The Proposal' beautifully portrays this fact. Suggest some steps how we can avoid this unhealthy practice.",
                    "Neighbors must have a cordial relationship which Lomov and Natalya do not have. Describe the first fight between them."
                ]
            },
            "Poems": {
                "Dust of Snow": [
                    "What is a 'dust of snow'? What does the poet say has changed his mood? How has the poet's mood changed?",
                    "Positive attitude in life can make the world a better place to live in. Do you agree or disagree with reference to the poem 'Dust of Snow'? Express your views bringing out the inherent values.",
                    "Our attitude towards a situation evokes both negative and positive responses. Analyze this with reference to the poem 'Dust of Snow' to bring out the inherent valuable lessons.",
                    "The poet has succeeded in giving valuable information in a light-hearted manner. What creates the desired effect? Highlight its importance in present-day life.",
                    "There are times when we feel depressed and hopeless. We think that things will never change. Suddenly, a change comes in our mood when cheerfulness replaces the sense of regret. Justify the above statement in the context of the poem 'Dust of Snow'."
                ],
                "Fire and Ice": [
                    "What is the underlying idea of the poem 'Fire and Ice'?",
                    "Which two ideas about how the world will end have been mentioned in the poem? Which idea does the poet support more?",
                    "What does 'fire' and 'ice' stand for, and what is the general opinion regarding the world?",
                    "What do people think about the ending of the world? What does the poet think?",
                    "How does the poem depict the two contrasting ideas—'Fire' and 'Ice'? Can hatred destroy us and the world? Explain, bringing out values which can make this world a better place to live in.",
                    "There are many ideas about how this world will come to an 'end'. What are they? Do you agree with the poet and his understanding of the poet and his understanding of the issue in this regard?"
                ],
                "A Tiger in the Zoo": [
                    "What do you understand by 'His strength behind bars'? What kind of a cage is he locked in?",
                    "Why do you think the tiger was stalking in the cage? What does it show?",
                    "The tiger in the poem 'A Tiger in the Zoo' has some obvious limitations, describe them in contrast to its natural habitat.",
                    "What is the theme of the poem?",
                    "Describe the movement of the tiger in the cage and in the wild.",
                    "What does the tiger do at night? What does he feel when he stares at the brilliant stars in the sky?",
                    "Freedom is such an essential virtue that is valued not only by human beings but also by animals alike. Justify the statement with reference to Leslie Norris's poem 'A Tiger in the Zoo'."
                ],
                "How to Tell Wild Animals": [
                    "How does one identify a chameleon?",
                    "What is the famous saying associated with crocodiles and what does it mean?",
                    "What is the theme of the poem — 'How to Tell Wild Animals'?",
                    "What does the poet say about the Asian Lion in this poem?",
                    "Many animals can be identified according to the poet's suggestion. Name the animals. Which ones would you like to identify? Are there any lessons for us from this poem?",
                    "Every animal is unique and has some special characteristics. What tricks does the poet adopt in distinguishing various wild animals?",
                    "Carolyn Wells takes liberties with language and employs humor to describe the wild animals. Give some examples of humorous descriptions in the poem."
                ],
                "Amanda!": [
                    "How old do you think Amanda is? How do you know this?",
                    "Who do you think is speaking to her?",
                    "What could Amanda do if she were a mermaid?",
                    "Is Amanda an orphan? Why does she say so?",
                    "What does the girl yearn for? What does this poem tell you about Amanda?",
                    "What message does the poet want to give through the poem — 'Amanda'?"
                ],
                "From the Diary of Anne Frank": [
                    "What motivated Anne Frank to write in a diary?",
                    "Give a brief life-sketch of Anne Frank.",
                    "Give a brief description of Anne Frank's family.",
                    "How did Mr Keesing take Anne's third essay in verse? How did he react? Do you find a change in him?",
                    "Describe the three essays written by Anne Frank.",
                    "Mr Keesing punished Anne by giving her an essay to write. Did he lack empathy and compassion? Was it not in his attitude to respect differences among the students? What values would you like to inbuilt in him and why?",
                    "Give a brief character-sketch of Mr Keesing highlighting the transformation that comes in him in the end.",
                    "Do you agree that Anne Frank was far more intelligent, mature and witty than her age? Give a reasoned answer."
                ],
                "The Hundred Dresses-I": [
                    "Where in the classroom does Wanda sit and why?",
                    "Where does Wanda live? What kind of a place do you think it is?",
                    "In what ways was Wanda different from other children?",
                    "Did Wanda have a hundred dresses? Why do you think she said she did?",
                    "Who did Maddie think would win the drawing contest? Why?",
                    "What kind of girl was Peggy?",
                    "What was the effect of the letter from Wanda's father on Miss Mason? How did Maddie react to it?"
                ],
                "The Hundred Dresses-2": [
                    "Why has Wanda's father written a letter to Mrs. Mason?",
                    "What important decision did Maddie make when she found that the Petronskis were gone? Why did she have to think a lot to do so?",
                    "Who sent that letter and why?",
                    "How did Peggy and Maddie know that the Petronskis were gone?",
                    "What was the hardest thinking that Maddie had done and what was the result?",
                    "How would you compare and contrast Peggy and Maddie?"
                ]
            }
        },
        "Footprints Without Feet": {
            "A Triumph of Surgery": [
                "What evidence do we have in the story that tells us that Mrs. Pumphrey was a rich lady?",
                "Why did Mrs. Pumphrey call the doctor?",
                "Why were the household dogs not interested in Tricki?",
                "What was the main cause of 'Tricki's ill-health'?",
                "Herriot is a dutiful doctor who cared for others' emotions more than his personal interests. Prove the above statement.",
                "Why was Tricki sent to the hospital?"
            ],
            "The Thief's Story": [
                "Why did Hari Singh not make many friends?",
                "Why was it difficult for Hari Singh to rob Anil?",
                "Why was the thief able to steal from Anil easily?",
                "Why did Hari Singh feel bad after stealing the money?",
                "Why did Anil decide to pay Hari Singh regularly?",
                "Anil plays a major role in the transformation of Hari Singh. Comment on the statement by highlighting the values possessed by Anil which touched Hari's heart and made him return to his honest ways of earning his livelihood."
            ],
            "The Midnight Visitor": [
                "What made the story of the balcony so convincing?",
                "How did Max go out of Ausable's room to save himself from the police?",
                "How did Ausable kill Max without using a weapon?",
                "How and why did Max come inside Ausable's room?",
                "How was Ausable different from the other secret agents?",
                "Why was Ausable confident that Max could never return?"
            ],
            "A Question of Trust": [
                "How did Horace know all the details of the house?",
                "How did Horace fulfill his desire of reading books after he was arrested?",
                "Though Horace planned everything meticulously, why did he fail?",
                "How did the flowers cause him trouble?",
                "What was Horace Danby's hobby? How did he manage to fulfill his hobby?",
                "How did the lady spoil his plan?"
            ],
            "Footprints without Feet": [
                "Why was Mrs. Hall angry with Griffin, the strange scientist?",
                "How did Griffin try to get rid of Mrs. Hall's accusations? Griffin didn't like Mrs. Hall at all.",
                "Why did Griffin set the landlord's house on fire?",
                "How did Griffin escape from the London store?",
                "How did Griffin become invisible?",
                "Why were the landlord and his wife surprised to see the scientist's door open?"
            ],
            "The Making of a Scientist": [
                "What rare achievement did Richard manage at the age of twenty-two?",
                "Richard became a collector at an early age. How?",
                "Comment on the role played by Richard's mother in his success.",
                "How did 'The Travels of Monarch X' prove a turning point in his life?",
                "Why did Richard lose interest in tagging butterflies?",
                "Which project did Richard undertake in the eighth grade?"
            ],
            "The Necklace": [
                "What would Matilda often dream of?",
                "Why did Matilda throw the invitation spitefully?",
                "Do you think M. Loisel had an enjoyable evening at the ball? Give reasons for your answer.",
                "What excuse did the Loisels put up to explain the delay in returning the necklace?",
                "How did the Loisels manage to pay for the necklace?",
                "How did Mme Loisel now know the life of necessity?"
            ],
            "Bholi": [
                "\"God cannot be everywhere, so he created Mothers\". Do you think Bholi's mother complies with this statement? Give reasons supporting your answer.",
                "What was the initiative taken by Ramlal to persuade Bishamber to marry Bholi?",
                "Did Bholi feel better when her teacher assured to make her the most learned in her village?",
                "Give two points to demonstrate that Bholi's wedding was a grand one.",
                "What two actions did Bholi take to stop her marriage to Bishamber?",
                "How did Bholi console her father in the end?",
                "Draw a conclusion as to why Bholi's teacher felt like an artist admiring her masterpiece.",
                "What did the Tehsildar suggest to Ramlal?"
            ],
            "The Book That Saved the Earth": [
                "How did the children's book transform his life?",
                "Why did Think-Tank react in alarm to the third passage read?",
                "What different guesses were made by the Martians about what books are?",
                "What steps did the Crew take to decipher the code in the sandwich?",
                "Why did Think-Tank send his crew on the earth?",
                "How did Think-Tank interpret the poem 'The Cat and the Fiddle'?",
                "How does Think-Tank describe the people on Earth? Why does he command Noodles to contact the Space probe?",
                "What do historians speak about the books?"
            ]
        }
    },
    "Science": {
        "Chemical Reactions and Equations": [
            "A reddish brown metal X when heated in presence of oxygen forms a black compound Y Which is basic in nature when heated with hydrogen gas gives back X. Identify X & Y. Write the chemical reaction between Y & Identify the substance being oxidized & Reduced.",
            "Why does the colour of copper sulphate solution change when an iron nail is dipped in it?",
            "Identify the substances that are oxidized and the substances that are reduced in the following reactions. (i) 4Na (s) + O2 (g)  2Na2O (s) (ii) CuO (s) + H2  Cu (s) + H2O (l)",
            "Translate the following statements into chemical equations and then balance them. (a) Hydrogen gas combines with nitrogen to form ammonia. (b) Hydrogen sulphide gas burns in air to give water and Sulpher dioxide. (c) Barium chloride reacts with aluminum sulphate to give aluminum chloride and precipitate of barium sulphate.",
            "Balance the following chemical equations: (a) HNO3 + Ca(OH)2  Ca(OH)2 àCa(NO3)2 +H2O (b) NaOH +H2SO4  Na2SO4 +H2O (c) NaCl +AgNO3  AgCl + NaNO3 (d) BaCl2 +H2SO4  BaSO4 +HCl",
            "Write the balanced chemical equations for the following reactions. (a) Calcium hydroxide + Carbon dioxide  Calcium carbonate + Water (b) Zinc + Silver nitrate  Zinc nitrate + Silver (c) Aluminum + Copper chloride  Aluminum chloride +Copper (d) Barium chloride + Potassium sulphate  Barium sulphate + potassium chloride",
            "Write the balanced chemical equation for the following and identify the type of reaction in each case. (a) Potassium bromide (s) + Barium iodide (aq)  Potassium iodide (aq) + Barium bromide(s) (b) Zinc carbonate (s)  Zinc oxide (s) + Carbon dioxide (g) (c) Hydrogen (g) + Chlorine (g)  Hydrogen chloride (g) (d) Magnesium (s) + Hydrochloric acid (aq)  Magnesium chloride (aq) + Hydrogen (g)",
            "What does one mean by exothermic and endothermic reactions? Give examples.",
            "Why decomposition reactions are called the opposite of combination reactions? Write equations for these reactions.",
            "Write one equation each for decomposition reactions where energy is supplied in the form of heat, light or electricity.",
            "What is difference between displacement and double displacement reactions? Write equations for these reactions.",
            "Explain the following in terms of gain and loss of oxygen with two examples each? (a) Oxidation (b) Reduction",
            "Explain the following terms with one example each. (a) Corrosion (b) Rancidity."
        ],
        "Acids, Bases and Salts": [
            "The pH of rainwater collected from two cities A and B was found to be 6 and 5 respectively. Water of which city is more acidic? Find out the ratio of hydrogen ion concentration in the two samples of rainwater?",
            "Arrange the following in ascending order of their pKa values: Solution, Blood, Lemon Juice.",
            "Why does an aqueous solution of acid conduct electricity?",
            "How does the concentration of hydrogen ions change when the solution of an acid is diluted with water?",
            "Which has a higher pH, a concentrated or dilute solution of HCl?",
            "Compound such as alcohols and glucose also contain hydrogen but are not categorized as acids. Describe an activity.",
            "A compound X is bitter in taste. It is a component of washing powder and reacts with dilute HCl to produce brisk effervescence due to a colorless, odorless gas Y, which turns lime water milky due to the formation of Z. When excess of it is passed, the milkiness disappears due to the formation of P. Identify X, Y, Z, and P.",
            "When gas passes through a saturated solution of ammonia in brine, two compounds 'X' and 'Y' are formed. 'Y' is used as an antacid and decomposes to form another solid 'Z'. Identify X, Y, Z, and write chemical equations.",
            "A substance 'X' used in the kitchen for making tasty crispy pakoras and is also an ingredient of an antacid. Name the substance 'X'."
        ],
        "Metals and Non-metals": [
            "Name a metal which does not stick to glass.",
            "Name a non-metal which is a good conductor of electricity.",
            "Name the metal which is commonly used in thermit welding.",
            "What gets deposited at the cathode, a pure or impure metal?",
            "What is the nature of zinc oxide?",
            "Name three common forms in which metals occur in nature. Explain the interaction between metals and dilute acid.",
            "Why is ZnO called an amphoteric oxide? Name another amphoteric oxide.",
            "What are alkalis? Give one example of an alkali.",
            "Write three important properties of aluminum that are responsible for its great demand in the industry.",
            "Define an alloy and an amalgam. State the main constituents of the following alloys: Stainless steel, Bronze. In which property is each of them different from its main constituent?",
            "Write one point of difference between electrolytic reduction and reduction with carbon. Give one example of each.",
            "Write any three differences between metals and non-metals based on chemical properties.",
            "Why is titanium metal called a strategic metal? Mention two of its properties that make it special.",
            "A man went door to door posing as a goldsmith. He promised to bring back the glitter of the old and dull ornaments. An unsuspecting lady gave a set of gold bangles to him, which he dipped in a particular solution. The bangles sparkled like new but their weight was reduced drastically. The lady was upset, but after a futile argument, the man beat a hasty retreat. Can you play the detective to find out the nature of the solution he had used?",
            "A metal 'X' is found in the form of filings which burns vigorously when sprinkled on a flame. When these filings are treated with sulfur, a black-colored compound 'Y' is formed which is not attracted by a magnet. 'X' reacts with dilute HCl to liberate hydrogen gas. 'X' reacts with steam to form 'Z' along with hydrogen gas. Identify 'X', 'Y', and 'Z'. Write the reaction involved."
        ],
        "Carbon and its Compounds": [
            "Why does micelle formation take place when soap is added to water? Will a micelle be formed in other solvents such as ethanol also?",
            "Name the gas evolved during the fermentation process.",
            "What role is played by yeast in the conversion of cane sugar to ethanol?",
            "Why does carbon form the largest number of compounds?",
            "Why are some of these called saturated and others unsaturated compounds?",
            "What is the role of concentrated H2SO4 in the esterification reaction?",
            "What is meant by denatured alcohol? What is the need to denature alcohol?",
            "What is a homologous series? State any two characteristics of a homologous series.",
            "What are enzymes? Name the enzymes required for the fermentation of sugar cane to ethanol.",
            "Write three differences between ethanol and ethanoic acid based on chemical properties.",
            "How can ethanol and ethanoic acid be differentiated based on their physical and chemical properties?",
            "Why are carbon and its compounds used as fuels for most applications?",
            "Explain the formation of scum when hard water is treated with soap.",
            "What change will you observe if you test soap with litmus paper (red and blue)?",
            "What is hydrogenation? What is its industrial application?",
            "Explain the mechanism of the cleaning action of soap.",
            "A compound works well with hard water. It is used for making shampoos and products for cleaning clothes. It is not 100%% biodegradable and causes water pollution. 'B' does not work well with hard water. It is 100%% biodegradable and does not create water pollution. Identify A and B.",
            "A compound 'X' with a molecular formula C burns with a sooty flame. It decolorizes bromine water. Identify 'X'. Will it dissolve in water or not? Will it conduct electricity in an aqueous solution? Will it have a high melting point or low melting point?"
        ],
        "Life Processes": [
            "What is 'clotting of blood'? What are the major events taking place in the clotting of blood?",
            "Mention the important parts of the human excretory system and explain them.",
            "Describe the role of the following in digestion: Bile, Salivary amylase, HCl",
            "Discuss the mechanism/process of respiration in human beings.",
            "Describe an experiment to prove that carbon dioxide is essential for the process of photosynthesis.",
            "Describe the functioning of the nephron.",
            "Describe double circulation in human beings. Why is it necessary?",
            "What are the necessary conditions for autotrophic nutrition, and what are its by-products?",
            "How are fats digested in our bodies? Where does this process take place?",
            "How is the amount of urine produced regulated?",
            "What are the methods used by plants to get rid of excretory products?",
            "How is food transported in plants?",
            "How are water and minerals transported in plants?",
            "What are the components of the transport system in highly organized plants?",
            "Why is it necessary to separate oxygenated and deoxygenated blood in mammals and birds?",
            "What are the components of the transport system in human beings? What are the functions of these components?",
            "How is oxygen and carbon dioxide transported in human beings?",
            "What are the different ways in which glucose is oxidized to provide energy in various organisms?",
            "What advantage over an aquatic organism does a terrestrial organism have with regard to obtaining oxygen for respiration?",
            "What is the role of the acids in our stomach?",
            "Where do plants get each of the raw materials required for photosynthesis?",
            "What are the differences between autotrophic and heterotrophic nutrition?",
            "What processes would you consider essential for maintaining life?",
            "What are outside raw materials used for by an organism?",
            "Why and how does water enter continuously into the root xylem of plants?",
            "What is the role of the skin, lungs, and intestine in the process of excretion in humans?",
            "What are the functions of the human respiratory system?",
            "Differentiate inhalation and exhalation.",
            "The dark reaction of photosynthesis does not need light. Do plants undergo the dark reaction at night? Explain.",
            "How are lungs designed in human beings to maximize the area of exchange of gases?",
            "What do you mean by 'lymph'? Mention its function.",
            "With the help of a labeled diagram, discuss the structure of the cross-section of a leaf.",
            "Discuss the process of nutrition in amoeba.",
            "Discuss the major steps involved in the process of nutrition in human beings.",
            "How is transpiration pull responsible for the upward movement of water?",
            "How does respiration take place in plants?",
            "What is 'translocation'? Why is it essential for plants?",
            "Give an experiment to prove the essentiality of light for photosynthesis.",
            "What are the modes of excretion in plants?",
            "How is hemoglobin associated with respiration explained?",
            "What are the functions of lymph in our body?"
        ],
        "Control and Co-ordination in Animals and Plants": [
            "Compare nervous and hormonal mechanisms for control.",
            "(a) What are hormones?",
            "(b) List four characteristics of hormones.",
            "Design an experiment to demonstrate hydrotropism.",
            "Explain the functions of neurons.",
            "Mention three important functions of gibberellins.",
            "What is the function of receptors in our body? What happens when receptors do not work properly?",
            "What happens at the synapse between two neurons?",
            "What is the need for a system of control and coordination in an organism?",
            "Pituitary is a master endocrine gland. Justify this statement.",
            "How does our body respond when adrenaline is secreted into the blood?",
            "Where are the Pons and medulla oblongata located? Write their functions.",
            "List the functions of testosterone and estrogen. Where are they secreted?",
            "Define 'nerve impulse'.",
            "Differentiate between axon and dendrites.",
            "Mention the structure of the human brain.",
            "What are tropic movements? Name the types of tropic movements in plants.",
            "How do auxins promote the growth of a tendril around a support?",
            "Write the difference between exocrine and endocrine glands.",
            "What are the different kinds of neurons?",
            "How does chemical coordination take place in animals? Mention their functions.",
            "Nervous and hormonal systems together perform the functions of control and coordination in human beings. Justify the statement.",
            "What is the difference between a reflex action and walking?",
            "What happens at the synapse between two neurons?",
            "How do auxins promote the growth of a tendril around a support?",
            "How does our body respond when adrenaline is secreted into the blood?",
            "Why are some patients of diabetes treated by giving injections of insulin?",
            "What is the function of receptors in our body? Think of a situation where receptors do not work properly. What problems are likely to arise?",
            "How does phototropism occur in plants?",
            "Which signals will get disrupted in the case of a spinal cord injury?",
            "How does chemical coordination occur in plants?",
            "What is the need for a system of control and coordination in an organism?",
            "How are involuntary actions and reflex actions different from each other?",
            "Compare and contrast the nervous system and hormonal control and coordination in animals.",
            "What is the difference between the manner in which movements take place in a sensitive plant and movements in our legs?",
            "On touching a hot plate, you suddenly withdraw your hand. Which category of neurons becomes active first and which one next?",
            "How does the plant shoot bend when the plant is placed in a room with only one open window?",
            "A man becomes unconscious due to a head injury. A pin is pricked on his foot, and he withdraws his foot. Why? Explain."
        ],
        "Reproduction": [
            "Describe triples fusion in plants? Where does it occur?",
            "Mention the parts of the female reproductive system.",
            "Mention the parts of the male reproductive system.",
            "Differentiate between asexual and sexual reproduction.",
            "What is the need for population control?",
            "What changes occur in girls and boys in the age group of 10 -14 years?",
            "Describe sexually transmitted diseases (STDs) and mention the ways to prevent them.",
            "Name the surgical methods of birth control in human males and females respectively.",
            "What are the essential requisites for sexual reproduction?",
            "What is micropropagation? Mention its advantages.",
            "Mention the events taking place when the ovum is fertilized in the fallopian tube till it is implanted in the uterus of a human female.",
            "What are the post-fertilizational changes in the flower?",
            "What are the major factors responsible for population explosion?",
            "What are the advantages of vegetative propagation?",
            "Describe any 3 methods of asexual reproduction.",
            "What changes occur in ovaries during the menstrual cycle?",
            "Describe budding in yeast, a fungus.",
            "What is the importance of reproduction?",
            "How are spores produced in the sporangium of Rhizopus?",
            "Diagrammatically represent binary fission in amoeba.",
            "Draw a flow chart showing various types of reproduction with examples.",
            "What is grafting? Why is it used in horticulture practices?",
            "What are the different methods of contraception?",
            "What is AIDS? Name its causal organism. Mention its symptoms.",
            "Explain vegetative reproduction through layering. Give examples.",
            "What is the importance of DNA copying in reproduction?",
            "Why is variation beneficial to the species but not necessarily for the individual?",
            "How does binary fission differ from multiple fissions?",
            "Can you think of reasons why a more complex organism cannot give rise to new individuals through regeneration?",
            "Why is vegetative propagation practiced for growing some types of plants?",
            "Why is DNA copying an essential part of the process of reproduction?",
            "How does the embryo get nourishment inside the mother's body?",
            "Why does menstruation occur?",
            "What are the different methods of contraception?",
            "What could be the reasons for adopting contraceptive methods?",
            "Producing individuals by parents consumes a lot of energy. So, why should an individual organism waste energy in the process it does not need to stay alive?",
            "Blueprints of body design are stored in DNA. Why?",
            "Why is variation beneficial to the species but not necessary for the individual?",
            "What is the advantage of reproduction through spores in the case of Rhizopus?"
        ],
        "Heredity and Evolution": [
            "Do you agree with the statement that only variations that confer an advantage to an individual organism will survive in a population? Why or why not?",
            "What are the different approaches to determine the evolutionary history of man?",
            "What is fossilization and how are fossils formed?",
            "Explain the concepts of homologous and analogous organs with examples.",
            "What is the difference between convergent and divergent evolution?",
            "What are the different ways in which individuals with a particular trait may increase in a population?",
            "What are the different theories about the origin of life?",
            "What is the difference between chemical evolution and organic evolution?",
            "Differentiate between homologous and analogous organs.",
            "State three laws of Mendel.",
            "Describe how the sex of the offspring is determined in human beings.",
            "Give a suitable explanation for how the geographical isolation of individuals of a species leads to the formation of a new species.",
            "What is the evolutionary force that leads to the origin of a new species?",
            "What is a fossil and how do fossils tell us about the process of evolution?",
            "Give the difference between diploid and haploid.",
            "Who disproved Lamarckism and how?",
            "How does Archaeopteryx provide evidence for organic evolution?",
            "What is divergent evolution and explain it with an example.",
            "What is the difference between reproductive and non-reproductive variations?",
            "Write the similarities between Mendel's factors and genes.",
            "How does the creation of variations in a species promote survival?",
            "How do Mendel's experiments show that traits may be dominant or recessive?",
            "How do Mendel's experiments show that traits are inherited independently?",
            "A man with blood group A marries a woman with blood group O and their daughter has blood group O. Is this information enough to tell you which of the traits (blood group A or O) is dominant? Why or why not?",
            "How is the sex of the child determined in human beings?",
            "What factors could lead to the rise of a new species?",
            "Will geographical isolation be a major factor in the speciation of self-pollinating plant species? Why or why not?",
            "Will geographical isolation be a major factor in the speciation of an organism that reproduces asexually? Why or why not?",
            "What are fossils and what do they tell us about the process of evolution?",
            "A study found that children with light-coloured eyes are likely to have parents with light-coloured eyes. Can we say anything about whether the light eye colour trait is dominant or recessive based on this information? Why or why not?",
            "Explain the terms analogous and homologous organs with examples.",
            "What evidence do we have for the origin of life from inanimate matter?",
            "Explain how sexual reproduction gives rise to more viable variations than asexual reproduction and how this affects the evolution of organisms that reproduce sexually.",
            "Do you agree with the statement that only variations that confer an advantage to an individual organism will survive in a population? Why or why not?",
            "How is the equal genetic contribution of male and female parents ensured in the progeny?",
            "When a new species emerges, is the old species eliminated? Why or why not?",
            "Why are traits acquired during the lifetime of an individual not inherited?",
            "In a cross between green-stemmed and purple-stemmed tomato plants (GG x GG), what color of stem would you expect in the progeny? Give the percentage of purple-stemmed plants if the F1 generation is self-pollinated. In what ratio would you find the gene types CG and Gg in the F1 progeny?",
            "What are the causes of variations in clones?"
        ],
        "Reflection and Refraction of Light": [
            "Calculate the distance at which a convex lens forms a real and inverted image of an object 20 cm away from the lens, with a focal length of 10 cm. Also, determine the size of the image if the object is 2 cm high. Provide a ray diagram to illustrate the image formation.",
            "Draw a ray diagram to demonstrate the formation of images with the following characteristics using a convex lens: (a) Real, inverted, and diminished, and (b) Virtual, erect, and magnified.",
            "A convex lens produces a real and inverted image of a needle, which is the same size as the object. If the image is formed at a distance of 50 cm from the lens, determine the position of the needle in front of the lens. Additionally, calculate the power of the lens.",
            "If one-half of a convex lens is covered with black paper, will it still produce a complete image of an object? Provide experimental verification and explain the observations.",
            "An object 5 cm in length is placed 25 cm away from a converging lens with a focal length of 10 cm. Draw a ray diagram to determine the position, size, and nature of the image formed.",
            "A convex lens with a focal length of 15 cm forms an image 10 cm away from the lens. How far is the object placed from the lens? Provide a ray diagram to illustrate the image formation.",
            "An object is placed 12 cm in front of a concave mirror, and a real image is formed that is four times larger than the object. Calculate the distance of the image from the mirror.",
            "Draw a ray diagram to represent the nature, position, and size of the image formed by a convex lens for an object placed at (a) infinity and (b) between the optical center and the focus.",
            "A convex mirror with a focal length of 200 cm is used, and a scooter is located 100 cm away from the mirror. Determine the position, nature, and magnification of the image formed in the mirror.",
            "A concave lens with a focal length of 20 cm forms an image 15 cm away from the lens. Calculate the distance at which a 5 cm tall object should be placed in front of the lens, and determine the size of the image formed.",
            "An object is placed at a distance of 15 cm from (a) a convex mirror, (b) a concave lens, and (c) a plane mirror. The convex mirror and concave lens both have a focal length of 10 cm. Draw ray diagrams to show the formation of images in each case.",
            "State the mirror formula for determining the focal length of spherical mirrors and explain the meaning of the symbols used. Calculate the distance of the image from a concave mirror with a focal length of 15 cm when the object is placed 25 cm away from the mirror.",
            "A convex lens with a focal length of 12 cm forms an image of an object 5 cm high placed at a distance of 20 cm from the lens. Determine the position, nature, and size of the image formed.",
            "An object is kept at a distance of (a) 20 cm and (b) 30 cm from a convex lens with a focal length of magnitude 15 cm. Draw ray diagrams to show the formation of images in both cases.",
            "A concave mirror is used to form an erect and enlarged image of a given object. Where is the image located with respect to the mirror? Draw a ray diagram to illustrate the image formation.",
            "How can you demonstrate that when a ray enters a rectangular glass slab obliquely and emerges from the opposite face, the emergent ray is parallel to the incident ray?"
        ],
        "Human Eye": [
            "What is hypermetropia?",
            "What are the two causes of this defect of vision?",
            "What is scattering of light?",
            "Why do astronauts observe the sky as dark instead of blue?",
            "Calculate the focal length of the lens used for correcting his distant vision.",
            "Calculate the focal length of the lens used for correcting his near vision.",
            "What is presbyopia?",
            "State the causes of this defect.",
            "How is presbyopia of a person corrected?",
            "Is it correct to say that a rainbow is always formed in a direction opposite to the sun?",
            "Can a rainbow be seen on a sunny day?",
            "Arrange the sequence in correct sequential order: Refraction, Internal Reflection, Refraction & Dispersion.",
            "Write two causes of hypermetropia.",
            "Show diagram to show the correctness of hypermetropia.",
            "Justify each statement: (a) The length of the day is the same as observed on the Earth. (b) The sky appears black in color. (c) The stars appear to twinkle while the planets do not do so as they do on the Earth.",
            "What is the focal length of the lens required for correcting his distant vision?",
            "What is the focal length of the lens required for correcting his near vision?",
            "Why do stars twinkle?",
            "Explain why the planets do not twinkle.",
            "Why does the sky appear dark instead of blue to astronauts?",
            "What focal length glass should a person use if they have a minimum distance of distinct vision of 150 cm and wish to read at a distance of 25 cm? What is the nature of the eye defect?"
        ],
        "Electricity": [
            "Two wires A and B are of equal length, different cross-sectional areas and made of the same metal. (a)(i) Name the property which is the same for both the wires. (ii) Name the property which is different for both the wires. (b) If the resistance of wire A is four times the resistance of wire B, calculate (i) the ratio of the cross-sectional areas of the wires and (ii) the ratio of the radii of the wires.",
            "State Ohm's law.",
            "he value of current (I) flowing through a conductor for the corresponding values of potential difference (V) across the conductor are given below. Plot a graph between V and I and also calculate resistance.",
            "Define electrical energy with the SI unit.",
            "A household uses the following electric appliances: (i) Refrigerator of rating 400W for ten hours each day. (ii) Two electric fans of rating 80W each for twelve hours each day. (iii) Six electric tubes of rating 18W each for six hours each day. Calculate the electricity bill of the household for the month of June if the cost per unit of electric energy is Rs. 3.00.",
            "What are the advantages of connecting electrical devices in parallel with the battery instead of connecting them in series?",
            "How can three resistors of resistance 2Ω, 3Ω, and 6Ω be connected to give a total resistance of (a) 4Ω and (b) 9Ω?",
            "The value of current (I) flowing in a given resistor for the corresponding values of potential difference (V) across the resistor are given below. Plot a graph between V and I and calculate the resistance of that resistor.",
            "Explain the following: (a) Why is tungsten used almost exclusively for the filament of electric lamps? (b) Why are the conductors of electric heating devices, such as bread-toasters and electric irons, made of an alloy rather than a pure metal? (c) Why is the series arrangement not used for domestic circuits? (d) How does the resistance of a wire vary with its area of cross-section? (e) Why are copper and aluminum wires usually employed for electric transmission?",
            "Two metallic wires A and B are connected in series. Wire A has length l and radius r, while wire B has length 2l and radius 2r. Find the ratio of the total resistance of the series combination to the resistance of wire A, if both the wires are made of the same material.",
            "Should the heating element of an electric iron be made of iron, silver, or nichrome wire? Justify your answer with three reasons.",
            "(a) Define electric resistance of a conductor. (b) A wire of length L and resistance R is stretched so that its length is doubled and the area of cross-section is halved. How will its (i) resistance change and (ii) resistivity change?",
            "Two resistors of resistances R and 2R are connected in parallel in an electric circuit. Calculate the ratio of the electric power consumed by R and 2R.",
            "The length of different metallic wires, but of the same area of cross-section and made of the same material, are given below. (i) Out of these two wires, which wire has higher resistance? (ii) Which wire has higher electrical resistivity? Justify your answer.",
            "6. Two resistors of resistances R and 2R are connected in series is an electrical circuit? Calculate the ratio of the electric power consumed by R and 2R?",
            "Two conducting wires of the same material and of equal lengths and equal diameters are first connected in series and then in parallel in an electric circuit. the ratio of heat produced in series and parallel combinations would be (a) 1:2 (b) 2:1 (c) 1:4 (d) 4:1",
            "Calculate (i) effective resistance (ii) current (iii) Potential difference across 10 resistor of a circuit shown in the figure.",
            "Apiece of wire of resistance is drawn out so that its length is increased to twice its original length calculate the resistance of the wire is the new situation?",
            "A battery made of 5 cells each of 2 V and have internal resistance is connected across resistance. Draw circuit diagram and calculate the current flowing through",
            "In the circuit diagram given here Calculate- (a) The total effective resistance (b) The total current (c) The current through each resistor.",
            "You have two circuits (i) a 6V battery is series with (ii) a 4V battery in parallel with Compare the power used in resistor in each case.",
            "How much energy is given to each coulomb of charge passing through a 6 volt battery?",
            "On what factor does the resistance of a conductor depend?",
            "Will current flow more easily through a thick wire or a thin wire of the same material, when connected to the same source? Why?",
            "Let the resistance of an electric component remains constant while the potential difference across the two ends of the component decreases to half of its former value. What change will occur in the current through it?",
            "Why are coils of electric toasters and electric irons made of an alloy rather than a pure metal?",
            "Draw a schematic diagram of a circuit consisting of a battery of three cells of 2 V, each, a 5 Ώ resistor, 8 Ώ resistors and a 12 Ώ and a plug key, all connected in series.",
            "An electric lamp of 100 Ω, a toaster of resistance 50 Ω and a water filter of resistance 500 Ω are connected in parallel to a 220 V source. What is the resistance of an electric iron connected to the same source that takes as much current as all three appliances, and what is the current through it?",
            "What is (a) the highest, (b) the lowest total resistance that can be secured by combination of four resistance of 4 Ω, 8 Ω, 12 Ω and 24 Ω?",
            "Why does the cord of an electric heater not glow while the heating element does?",
            "A copper wire has diameter 0.5 mm and resistivity of 1.6 x 10-8 m. what will be the length of this wire to make its resistance 10? How much does the resistance change if the diameter is doubled?",
            "A battery of 9 V is connected in series with resistance of 0.2 Ω, 0.3 Ω, 0.4 Ω, 0.5 Ω and 12 Ω respectively. How much current would flow through the 12 resistor?",
            "How many 176 Ω resistors (in parallel) are required to carry 5 A on a 220 V line?"
        ],
        "Magnetic Effects of Current": [
            "What is the function of an earth wire? Why is if necessary to earth metallic casing of electric appliance?",
            "We know a current carrying conductor placed in a magnetic field experiences a force due to which the conductor moves. How do we think the rod displaces if-(a) current in rod is increased (b) a stronger horse shoe is inserted (c) length of the rod is increased.",
            "What is the principle of electric motor? State the function of (i) split ring (ii) field magnet used in electric motor.",
            "State three factor on which magnetic field produced by a current carrying solenoid depends.",
            "What is a solenoid? Draw magnetic field lines showing the magnetic field inside and outside the current carrying solenoid?",
            "Name four appliances wherein an electric motor is used as an important component. In what respect it is different from generator? (b) Define the terms used in the generator (i) armature (ii) slip rings (iii) brushes",
            "What is the standard colour code followed for (i) live (ii) neutral and (iii) earth wires used in electric circuits? (b) Which part of an electric appliance is earthed and why?",
            "What is short circuiting? What is overloading? How can you avoid overloading?",
            "Define electromagnetic induction? Two circular coils A and B are placed close to each other. If the current in the coil A is changed, will some current be induced in the coil B? Explain.",
            "Why does a current carrying conductor kept in a magnetic field experience force? What is the direction of force acting on the conductor?",
            "(a) Distinguish between A.C and D.C? (b) Which source produces alternating current?",
            "(a) Define the term current rating of an electric fuse? (b) Name the material used to make electric fuse? (c) Name two safety measure commonly used in electric circuit and appliances?",
            "Why does a compass needle get deflected when brought near a bar magnet?",
            "List the properties of magnetic lines of force.",
            "In activity 13.7, how do we think the displacement of rod AB will be affected if (i) current is rod AB is increased, (ii) a stronger horse shoe magnet is used, and (iii) length of the rod AB is increased?",
            "State Fleming's left-hand rule.",
            "What is the principle of an electric motor?",
            "Explain different ways to induce current in a coil.",
            "An electric oven of 2 kW power rating is operated in a domestic electric circuit (220V) that has a current rating of 5.A. What result do you expect? Explain.",
            "What precaution should be taken to avoid the overloading of domestic electric circuit?",
            "List three methods of producing magnetic field.",
            "How does a solenoid behave like a magnet? Can you determine the north and south poles of a current carrying solenoid with the help of a bar magnet? Explain.",
            "Imagine that you are sitting in chamber with your back to one wall. An electron beam, moving horizontally from back wall towards the front wall, is deflected by a strong magnetic field to your right side. What is the direction of magnetic field?",
            "A coil of insulated copper wire is connected to a galvanometer. What will happen if a bar magnet is (i) pushed into the coil, (ii) withdrawn from inside the coil, (iii) held stationary inside the coil?",
            "Two circular coils A and B are placed close to each other. If the current in the coil A is changed, will some current be induced in the coil B? Give reason.",
            "State the rule to determine the direction of a\n(i) magnetic field produced around a straight current carrying conductor\n(ii) force experienced by a current carrying straight conductor\n(iii) current induced in a coil due to its rotation in a magnetic field.",
            "What is the function of an earth wire? Why is it necessary to earth metallic appliances?",
            "A coil of insulated copper wire is connected to a galvanometer. What would happen if a bar magnet Is.\n(i) Pushed into the coil?\n(ii) Withdrawn from the coil?\n(iii) Held stationary inside the coil?",
            "An electron enters a magnetic field at right angles to it as shown in fig. The direction of the force acting on the electron will be:\n(a) to the right\n(b) to the left\n(c) out of the page\n(d) into the page",
            "Consider a circular wire lying in the plane of the table and the direction current in it is antilock wise.\n(i) Draw the magnetic field lines produced around it.\n(ii) Why does magnetic field at the center of current carrying circular loop appear straight? Explain with diagram.",
            "If we place a compass needle near straight conductor carrying current (a)What happens to the deflection of the compass needle if the direction of current reversed. Is (b)What change will you notice in the compass needle if it is moved away from conductor but the current through the conductor remains the same?",
            "A magnet is moving towards a coil as shown in figure.\n(1) Which phenomenon is shown in figure.\n(2) Which physical quantity is between magnet and coil? set up in the coil when there is a relative motion\n(3) What may be the cause of production of that physical quantity?",
            "Suppose your science teacher asks you to demonstrate the phenomena of EMI with following materials:\n(a)Two different coils and 2 of copper wire having large no. of turns 50 and 100 respectively.\n(b) A non conducting cylinder.\n(c)A battery\n(d) A plug key\n(e) A galvanometer\n(i) Draw a labeled diagram of your demonstration setup.\n(ii)How will you prove the phenomena of EMI.",
            "Current- time graph from two different sources are shown in the figure.\n(i) Name the type of current shown by graph (A) and (B)?\n(ii) Name any one source of shown by (A) and (B)?\n(iii) What is the frequency of current in case (B)?\n(iv) Write two differences between the current shown by (A) and (B).",
            "Explain the principle, construction and working of an electric motor with the help of a labeled diagram.",
            "Draw a labeled diagram of an electric motor. Explain its principle and working. What is the function of split ring in an electric motor?",
            "Explain the underlying principle and working of an electric generator by drawing a labeled diagram. What is the function of brushes?"
        ],
        "Our Environment": [
            "Determine why DDT sprayed in minute amounts on food plants was detected in high concentrations in humans. Provide an explanation.",
            "Explain the process of ozone layer formation.",
            "What are the major components of the environment?",
            "Why do some substances biodegrade while others do not? Provide reasons.",
            "Explain why a food chain consists of only a few steps. Create a food chain with five steps.",
            "What is the difference between a food chain and a food web?",
            "Define biological magnification and illustrate it with an example.",
            "Enumerate the harmful effects of ozone layer depletion.",
            "What is the significance of food chains?",
            "How can garbage pollution be controlled? List three methods.",
            "Describe the components of an ecosystem and provide examples.",
            "Name three eco-friendly activities.",
            "Why is energy transfer unidirectional while biochemical transfer is cyclic?",
            "Compare and contrast producers and consumers. Provide an example of each.",
            "Why are there no predators for tigers or lions?",
            "What measures are being taken to protect the ozone layer?",
            "Describe three biotic components of an ecosystem and give examples.",
            "What is the role of decomposers in an ecosystem?",
            "What would happen if all organisms in one trophic level were killed?",
            "What is ozone, and how does it affect ecosystems?",
            "Why are some substances biodegradable while others are not?",
            "Explain two ways in which biodegradable substances affect the environment and two ways in which non-biodegradable substances affect the environment.",
            "What is biological magnification, and does its level differ at various ecosystem levels?",
            "Why is damage to the ozone layer a cause for concern? What steps are being taken to limit this damage?",
            "Why are some substances degraded while others are not?",
            "What would happen if all carnivores were removed from the Earth?",
            "What would happen to grasslands if all grazers were removed?",
            "What could be the cause for a tremendous increase in the number of malarial patients when a large number of frogs were exported from a village? Explain using a food chain.",
            "What are decomposers, and what is their importance in the ecosystem?",
            "Why do food chains typically consist of only three or four steps?",
            "What would happen if decomposers were absent from the environment?",
            "Are plants actually producers of energy? Explain.",
            "Examine the given figures and choose the correct one, providing a reason for your choice.",
            "Do you agree that waste management and disposal are solely the government's responsibility? Justify your answer with two reasons."
        ]
    },
    "Mathematics": {
        "Triangles" : [
            "Given ΔABC ~ ΔPQR, if AB/PQ = ⅓, then find (ar ΔABC)/(ar ΔPQR).",
            "The sides of two similar triangles are in the ratio 7 : 10.  Find the ratio of areas of these triangles.",
            "In an equilateral ΔABC, D is a point on side BC such that BD = (⅓) BC. Prove that 9(AD)2 = 7(AB)2",
            "Prove that in a right triangle, the square of the hypotenuse is equal to the sum of the squares of the other two sides.",
            "Two right triangles ABC and DBC are drawn on the same hypotenuse BC and on the same side of BC. If AC and BD intersect at P, prove that AP x PC = BP x DP.",
            "Diagonals AC and BD of a trapezium ABCD with AB || DC intersect each other at the point O. Using a similarity criterion for two triangles, show that OA/OC = OB/OD."
        ],
        "Real Numbers": [
            "Use Euclid's division lemma to show that the square of any positive integer is either of the form 3m or 3m + 1 for some integer m.",
            "Express each number as a product of its prime factors: (i) 140 (ii) 156 (iii) 3825 (iv) 5005 (v) 7429",
            "Given that HCF (306, 657) = 9, find LCM (306, 657).",
            "Prove that 3 + 2√5 is irrational.",
            "Without actually performing the long division, state whether the following rational numbers will have a terminating decimal expansion or a non-terminating repeating decimal expansion: (i) 13/3125 (ii) 17/8 (iii) 64/455 (iv) 15/1600",
            "The following real numbers have decimal expansions as given below. In each case, decide whether they are rational or not. If they are rational, and of the form p/q what can you say about the prime factors of q? (i) 43.123456789 (ii) 0.120120012000120000...",
            "Check whether 6n can end with the digit 0 for any natural number n.",
            "What is the HCF of the smallest prime number and the smallest composite number?"
        ],
        "Polynomials": [
            "Find the value of 'p' from the polynomial x² + 3x + p, if one of the zeroes of the polynomial is 2.",
            "Does the polynomial a⁴ + 4a² + 5 have real zeroes?",
            "Compute the zeroes of the polynomial 4x² - 4x - 8. Also, establish a relationship between the zeroes and coefficients.",
            "Find the quadratic polynomial if its zeroes are 0, √5.",
            "Find the value of 'x' in the polynomial 2a² + 2xa + 5a + 10 if (a + x) is one of its factors.",
            "How many zeros does the polynomial (x - 3)² - 4 have? Also, find its zeroes.",
            "α and β are zeroes of the quadratic polynomial x² - 6x + y. Find the value of 'y' if 3α + 2β = 20.",
            "If the zeroes of the polynomial x^3 - 3x² + x + 1 are a - b, a, a + b, then find the value of 'a' and 'b'.",
            "Find a quadratic polynomial each with the given numbers as the sum and product of its zeroes, respectively. (i) 1/4, -1 (ii) 1, 1 (iii) 4, 1"
        ],
        "Linear Equations In Two Variables": [
            "The cost of 2 kg of apples and 1kg of grapes on a day was found to be Rs.160. After a month, the cost of 4 kg of apples and 2 kg of grapes is Rs.300. Represent the situation algebraically.",
            "Half the perimeter of a rectangular garden, whose length is 4 m more than its width, is 36 m. Find the dimensions of the garden.",
            "On comparing the ratios a1/a2, b1/b2, and c1/c2, find out whether the following pair of linear equations are consistent, or inconsistent. (i) 3x + 2y = 5 ; 2x - 3y = 7 (ii) 2x - 3y = 8 ; 4x - 6y = 9",
            "Solve the following pair of linear equations by the substitution method. (i) x + y = 14 x - y = 4 (ii) 3x - y = 3 9x - 3y = 9",
            "Solve 2x + 3y = 11 and 2x - 4y = - 24 and hence find the value of 'm' for which y = mx + 3.",
            "The coach of a cricket team buys 7 bats and 6 balls for Rs.3800. Later, she buys 3 bats and 5 balls for Rs.1750. Find the cost of each bat and each ball.",
            "A fraction becomes 9/11 if 2 is added to both the numerator and the denominator. If, 3 is added to both the numerator and the denominator it becomes 5/6. Find the fraction."
        ],
        "Quadratic Equations": [
            "Represent the following situations in the form of quadratic equations: (i) The area of a rectangular plot is 528 m2. The length of the plot (in metres) is one more than twice its breadth. We need to find the length and breadth of the plot. (ii) A train travels a distance of 480 km at a uniform speed. If the speed had been 8 km/h less, then it would have taken 3 hours more to cover the same distance. What is the speed of the train?",
            "Find the roots of quadratic equations by factorisation: (i) √2 x2 + 7x + 5√2=0 (ii) 100x2 - 20x + 1 = 0",
            "Find two consecutive positive integers, the sum of whose squares is 365.",
            "Find the roots of the following quadratic equations, if they exist, by the method of completing the square: (i) 2x2 - 7x +3 = 0 (ii) 2x2 + x - 4 = 0",
            "The diagonal of a rectangular field is 60 metres more than the shorter side. If the longer side is 30 metres more than the shorter side, find the sides of the field.",
            "Solve the quadratic equation 2x2 - 7x + 3 = 0 by using the quadratic formula.",
            "The sum of the areas of two squares is 468 m2. If the difference of their perimeters is 24 m, find the sides of the two squares.",
            "Find the values of k for each of the following quadratic equations, so that they have two equal roots. (i) 2x2 + kx + 3 = 0 (ii) kx (x - 2) + 6 = 0"
        ],
        "Arithmetic Progression": [
            "Write the first four terms of the AP when the first term a and the common difference d are given as follows: (i) a = 10, d = 10 (ii) a = -2, d = 0 (iii) a = 4, d = - 3",
            "Which term of the AP: 21, 18, 15, . . . is - 81? Also, is any term 0? Give a reason for your answer.",
            "Check whether - 150 is a term of the AP: 11, 8, 5, 2 . . .",
            "If the 3rd and the 9th terms of an AP are 4 and -8, respectively, then which term of this AP is zero.",
            "Which term of the AP 3, 15, 27, 39, … will be 132 more than its 54th term?",
            "How many multiples of 4 lie between 10 and 250?",
            "The sum of the 4th and 8th terms of an AP is 24, and the sum of the 6th and 10th terms is 44. Find the first three terms of the AP."
        ],
        "Coordinate Geometry": [
            "Find the distance of the point P (2, 3) from the x-axis.",
            "Find a relation between x and y such that the point (x, y) is equidistant from the points (7, 1) and (3, 5).",
            "Find the coordinates of the points of trisection (i.e., points dividing into three equal parts) of the line segment joining the points A(2, - 2) and B(- 7, 4).",
            "Find the ratio in which the line segment joining the points (- 3, 10) and (6, - 8) is divided by (- 1, 6).",
            "Find the value of k if the points A(2, 3), B(4, k) and C(6, -3) are collinear.",
            "Find the area of the triangle formed by joining the mid-points of the sides of the triangle whose vertices are (0, -1), (2, 1) and (0, 3). Find the ratio of this area to the area of the given triangle.",
            "Name the type of triangle formed by the points A (-5, 6), B (-4, -2), and C (7, 5)."
        ],
        "Introduction to Trigonometry": [
            "In ∆ ABC, right-angled at B, AB = 24 cm, BC = 7 cm.",
            "If Sin A = 3/4, calculate cos A and tan A.",
            "If ∠A and ∠B are acute angles such that cos A = cos B, then show that ∠ A = ∠ B.",
            "If 3 cot A = 4, check whether (1 – tan^2A)/(1 + tan^2A) = cos^2 A – sin^2 A or not.",
            "In triangle PQR, right-angled at Q, PR + QR = 25 cm and PQ = 5 cm. Determine the values of sin P, cos P, and tan P.",
            "Evaluate 2 tan^2 45° + cos^2 30° – sin^2 60°.",
            "If tan (A + B) = √3 and tan (A – B) = 1/√3, 0° < A + B ≤ 90°; A > B, find A and B.",
            "Show that: (i) tan 48° tan 23° tan 42° tan 67° = 1 (ii) cos 38° cos 52° – sin 38° sin 52° = 0",
            "If tan 2A = cot (A – 18°), where 2A is an acute angle, find the value of A.",
            "If A, B, and C are interior angles of a triangle ABC, then show that sin [(B + C)/2] = cos A/2."
        ],
        "Some Applications of Trigonometry": [
            "The shadow of a tower standing on level ground is found to be 40 m longer when the Sun’s altitude is 30° than when it is 60°. Find the height of the tower.",
            "A tree breaks due to a storm and the broken part bends so that the top of the tree touches the ground making an angle of 30° with it. The distance between the foot of the tree to the point where the top touches the ground is 8 m. Find the height of the tree.",
            "Two poles of equal heights are standing opposite each other on either side of the road, which is 80 m wide. From a point between them on the road, the angles of elevation of the top of the poles are 60° and 30°, respectively. Find the height of the poles and the distances of the point from the poles.",
            "An observer 1.5 meters tall is 20.5 meters away from a tower 22 meters high. Determine the angle of elevation of the top of the tower from the eye of the observer.",
            "The angle of elevation of the top of a tower from two points distant s and t from its foot are complementary. Prove that the height of the tower is √st.",
            "The angle of elevation of the top of a tower from a certain point is 30°. If the observer moves 20 meters towards the tower, the angle of elevation of the top increases by 15°. Find the height of the tower.",
            "A circus artist is climbing a 20 m long rope, which is tightly stretched and tied from the top of a vertical pole to the ground. Find the height of the pole, if the angle made by the rope with the ground level is 30°.",
            "From the top of a 7 m high building, the angle of elevation of the top of a cable tower is 60° and the angle of depression of its foot is 45°. Determine the height of the tower."
        ],
        "Circles": [
            "From a point Q, the length of the tangent to a circle is 24 cm and the distance of Q from the centre is 25 cm. Find the radius of the circle.",
            "Prove that the tangents drawn at the ends of a diameter of a circle are parallel.",
            "A quadrilateral ABCD is drawn to circumscribe a circle as shown in the figure. Prove that AB + CD = AD + BC",
            "Two concentric circles are of radii 5 cm and 3 cm. Find the length of the chord of the larger circle which touches the smaller circle.",
            "Let s denote the semi-perimeter of a triangle ABC in which BC = a, CA = b, AB = c. If a circle touches the sides BC, CA, AB at D, E, F, respectively, prove that BD = s – b.",
            "In the figure, two tangents TP and TQ are drawn to a circle with centre O from an external point T, prove that ∠PTQ = 2OPQ.",
            "Prove that the lengths of tangents drawn from an external point to a circle are equal."
        ],
        "Constructions": [
            "Draw a line segment of length 7 cm. Find a point P on it which divides it in the ratio 3:5.",
            "Construct a triangle with sides 5 cm, 6 cm and 7 cm and then another triangle whose sides are 7/5 of the corresponding sides of the first triangle.",
            "Draw a circle of radius 3 cm. Take two points P and Q on one of its extended diameters, each at a distance of 7 cm from its centre. Draw tangents to the circle from these two points P and Q.",
            "Draw a circle with the help of a bangle. Take a point outside the circle. Construct the pair of tangents from this point to the circle.",
            "Draw two concentric circles of radii 3 cm and 5 cm. Taking a point on the outer circle, construct the pair of tangents to the other. Measure the length of a tangent and verify it by actual calculation.",
            "Draw a line segment AB of length 7 cm. Taking A as the centre, draw a circle of radius 3 cm and taking B as centre, draw another circle of radius 2 cm. Construct tangents to each circle from the centre of the other circle.",
            "Construct an equilateral ΔABC with each side 5 cm. Then construct another triangle whose sides are 2/3 times the corresponding sides of ΔABC."
        ],
        "Areas Related to Circles": [
            "The cost of fencing a circular field at the rate of Rs. 24 per metre is Rs. 5280. The field is to be ploughed at the rate of Rs. 0.50 per m2. Find the cost of ploughing the field (Take π = 22/7).",
            "What is the area of a circle whose circumference is 44 cm?",
            "Find the area of the sector of a circle with a radius of 4 cm and of angle 30°. Also, find the area of the corresponding major sector (Use π = 3.14).",
            "A calf is tied with a rope of length 6 m at the corner of a square grassy lawn of side 20 m. If the length of the rope is increased by 5.5m, find the increase in the area of the grassy lawn in which the calf can graze.",
            "A pipe of wire 22 cm long is bent into the form of an arc of a circle subtending an angle of 60° at its centre. Find the radius of the circle. [use π = 22/7]"
        ],
        "Surface Areas and Volumes": [
            "A canal is 300 cm wide and 120 cm deep. The water in the canal is flowing at a speed of 20 km/h. How much area will it irrigate in 20 minutes if 8 cm of standing water is desired?",
            "Two cones have their heights in the ratio 1 : 3 and radii in the ratio 3 : 1. What is the ratio of their volumes?",
            "Find the number of solid spheres each of diameter 6 cm that can be made by melting a solid metal cylinder of height 45 cm and diameter 4 cm.",
            "2 cubes each of volume 64 cm3 are joined end to end. Find the surface area of the resulting cuboid.",
            "Selvi's house has an overhead tank in the shape of a cylinder. This is filled by pumping water from a sump (an underground tank) which is in the shape of a cuboid. The sump has dimensions 1.57 m x 1.44 m x 95cm. The overhead tank has a radius of 60 cm and a height of 95 cm. Find the height of the water left in the sump after the overhead tank has been completely filled with water from the sump which had been full. Compare the capacity of the tank with that of the sump. (Use π = 3.14)",
            "Metallic spheres of radii 6 cm, 8 cm and 10 cm, respectively, are melted to form a single solid sphere. Find the radius of the resulting sphere."
        ],
        "Statistics": [
                "Find the mean of the 32 numbers, such that if the mean of 10 of them is 15 and the mean of 20 of them is 11. The last two numbers are 10.",
                "Find the mean of the first 10 natural numbers.",
                "Find the value of y from the following observations if these are already arranged in ascending order. The Median is 63.\n20, 24, 42, y , y + 2, 73, 75, 80, 99",
                "While checking the value of 20 observations, it was noted that 125 was wrongly noted as 25 while calculating the mean and then the mean was 60. Find the correct mean.",
                "Find the mode of the following items.\n0, 5, 5, 1, 6, 4, 3, 0, 2, 5, 5, 6",
                "A student scored the following marks in 6 subjects:\n30, 19, 25, 30, 27, 30\nFind his modal score.",
                "If the mean of 4 numbers, 2,6,7 and a is 15 and also the mean of other 5 numbers, 6, 18, 1, a, b is 50. What is the value of b?"
        ],
        "Probability": [
            "Two dice are thrown at the same time. Find the probability of getting (i) the same number on both dice. (ii) different numbers on both dice.",
            "A bag contains a red ball, a blue ball, and a yellow ball, all the balls being of the same size. Kritika takes out a ball from the bag without looking into it. What is the probability that she takes out the (i) yellow ball? (ii) red ball? (iii) blue ball?",
            "One card is drawn from a well-shuffled deck of 52 cards. Calculate the probability that the card will (i) be an ace. (ii) not be an ace.",
            "Two dice are numbered 1, 2, 3, 4, 5, 6 and 1, 1, 2, 2, 3, 3, respectively. They are thrown, and the sum of the numbers on them is noted. Find the probability of getting each sum from 2 to 9 separately.",
            "A coin is tossed two times. Find the probability of getting at most one head.",
            "An integer is chosen between 0 and 100. What is the probability that it is (i) divisible by 7? (ii) not divisible by 7?",
            "If P(E) = 0.05, what is the probability of 'not E'?",
            "12 defective pens are accidentally mixed with 132 good ones. It is not possible to just look at a pen and tell whether or not it is defective. One pen is taken out at random from this lot. Determine the probability that the pen is taken out is a good one.",
            "A die is thrown twice. What is the probability that (i) 5 will not come up either time? (ii) 5 will come up at least once?",
            "A die is thrown once. What is the probability of getting a number less than 3?"
        ]
    }
}